In [7]:
#Initial import
from open_refine_wrapper import data_explore
import pandas as pd

In [8]:
#read in pandas dataframe
df = pd.read_csv('Personal Information.csv')

In [9]:
#Overlook of the original dataframe
df.head()

   id first_name last_name  Age  Gender       Income State
0   1       Jean   Schmidt   19  Female  25000-49999    PA
1   2      Larry    Bishop   21    Male  50000-99999    OR
2   3     George    Flores   51    Male  50000-99999    NE
3   4     George     Lewis   55    Male  50000-99999    MO
4   5  Christine     Berry   56  Female  25000-49999    NC

In [10]:
#Invoke the open refine gui for data exploration
p = data_explore(df,"http://127.0.0.1:3333/")

In [11]:
#Save the project back to our dataframe
df = p.export_pandas_frame()

In [12]:
#The dataframe after my exploration
df.head()

   Column  id first_name  last_name  Age  Gender       Income State
0       0   1    THIS IS  CHANGED!!   19  Female  25000-49999    PA
1       1   2      Larry     Bishop   21    Male  50000-99999    OR
2       2   3     George     Flores   51    Male  50000-99999    NE
3       3   4     George      Lewis   55    Male  50000-99999    MO
4       4   5  Christine      Berry   56  Female  25000-49999    NC